[
  {
    "author": "Joe Oprych",
    "role": "Windows Platform Engineer",
    "company": "AXA Go",
    "text": "Susana was an absolute pleasure to work with at AXA. She stepped in and quickly organised a highly complex project, applying her strong knowledge of industry standards to help establish a clear roadmap for the year ahead. She is incredibly organised and brought a great deal of energy and enthusiasm to her role. She will be greatly missed."
  },
  {
    "author": "Daniel Bozi Ramalho",
    "role": "Agile Project Delivery | Scrum Master | Agile Coach",
    "company": "",
    "text": "I worked with Susana as a Scrum Master in a DevOps team where she was the Team Lead in 2025. Her high technical knowledge and communication skills allowed her to interact efficiently with our many stakeholders. She documented all our processes and strategy extensively, showing her commitment to the team, to the company and to a constant improvement mindset. I recommend Susana to any leading / strategic position in this field. I had a great time working with her."
  },
  {
    "author": "Geoffrey Bohen",
    "role": "IT Infrastructure Architect",
    "company": "ZETES Panasonic",
    "text": "As the founder of the DevOps team Susana helped zetes to grow in many different ways. During her time with us I could witness her determination and structuring influence. Her energy inspired us all. Any company would be very lucky to have her on the payroll."
  },
  {
    "author": "Thomas Moens",
    "role": "Independent Linux Engineer",
    "company": "",
    "text": "I had the privilege of working with Susana as my team lead and she made a lasting impact. She fostered a welcoming, supportive environment and approached every challenge with a solution-focused mindset. Susana is a calm, collaborative and results-driven leader who brings out the best in her team. I'd gladly work with her again."
  },
  {
    "author": "João Emanuel Figueiredo Antunes",
    "role": "Customer Experience Team Lead | Guiding Node Adoption at Catalyst/IntellectEU",
    "company": "",
    "text": "Susana is an amazing team player and most importantly she helped out a lot when we were discovering a new technology. Great person to talk and discuss technology as well as discuss the next steps. She is very direct and organised. Amazing person as well and really supportive."
  },
  {
    "author": "Efstathia Tsakali",
    "role": "Test Automation Engineer",
    "company": "TRASYS GREECE",
    "text": "I had the pleasure of working with Susana on the same team, where she played a key role in the evolution of the product, procedures and the team itself. Throughout our time working together, she consistently demonstrated a strong work ethic, a collaborative mindset and a high level of technical skill. Susana is a highly developed engineer who quickly became a technical expert within the team. She has a solid technical background and a great ability to grasp new ideas and concepts. She consistently demonstrates a high level of accountability and a strong sense of responsibility in everything she undertakes. She is dependable, always willing to offer support - even in areas outside her role - and extremely proactive in finding innovative solutions to the challenges the team faced. She consistently takes initiative and implements new ideas and improvements that benefit the entire team, always looking for ways to enhance our processes and outcomes, without compromising the quality of her deliverables. Working with Susana has been a great privilege, as I had the opportunity to acquire new technical skills that not only helped me grow as an engineer but also made me more efficient in my work. Additionally, despite working from a different location, she proved to be consistently reliable and trustworthy in all day-to-day tasks. What I appreciated most was the integrity she inspired and her strong sense of fairness, along with her ability to communicate clearly and work effectively across different functions - qualities that made her a valued teammate and a great person to collaborate with. She was a vital contributor to our team's achievements and I truly recognize her professionalism and dedication. I would gladly work with her again and confidently recommend her to any team or organization."
  },
  {
    "author": "Francisco Arantes Rodrigues",
    "role": "Software Engineer · Data & Cloud Pipelines · Frontend Architect · AI/ML Integrator",
    "company": "Founder at Layers Tech",
    "text": "It was a pleasure to work with Susana. I was always impressed by her unique ability to bridge the gap between technical and non-technical teams. She is not only a reliable and skilled IT professional with a keen eye for detail, but also a genuinely approachable and collaborative colleague. Susana's positive attitude and strong work ethic make her a true asset to any team and she can be counted on to deliver high-quality results. I highly recommend her."
  },
  {
    "author": "Balazs Farkas",
    "role": "IT Infrastructure Architect",
    "company": "",
    "text": "I had the pleasure of working with Susana while she was leading the DevOps team. Under her leadership, she successfully brought the team together and built a strong sense of unity. Thanks to her forward-thinking mindset and innovative solutions, she restructured daily operations and introduced new tools that made workflows more transparent and efficient. She also established excellent collaboration with other teams, making it a real pleasure to work with her and her team - not only on a professional level, but also on a personal one. I sincerely recommend her to anyone looking for a leader who can align people, processes and goals while ensuring continuous growth."
  },
  {
    "author": "Chadwick Rolfs",
    "role": "Python and Linux",
    "company": "",
    "text": "In my time working with Susana as my team lead, I felt encouraged and welcome as well as challenged to be my best and make an effort for the team. The complexities of technology, people and business were easily traversed by Susana and I was able to focus on my role, secure in Susana's leadership skills. Her outstanding way of working and brilliant understanding of all the available tools and processes were very impressive. Susana is highly recommended and will be a terrific asset to any team she joins: Thanks, Susana !"
  },
  {
    "author": "Anne-Sophie Hupet",
    "role": "Program & Project Management · Process Management · Team Management · Governance",
    "company": "",
    "text": "Some years ago, I had the pleasure to work with Susana. She was a software engineer in my teams. She integrated very fast our way of working, our work environment and understood very quickly what was expected from her. Her work was very rigorous and she respected the deadlines that were hers. I can say she was an asset in the developers' team ! I can recommend her for many skills : no doubt that her professionalism, pursuit of excellence, attention to details and focus will support her goals, whatever the job !"
  },
  {
    "author": "Sreekanth Reddy",
    "role": "Cloud Architecture and DevOps Consultant",
    "company": "",
    "text": "I had the privilege of working with Susana as part of her DevOps team and I can confidently say she is an exceptional leader. Her deep technical knowledge across containers, CI/CD and infrastructure automation is impressive, but what truly sets her apart is her ability to support team members. Susana consistently demonstrates a perfect balance of strategic thinking and hands-on problem-solving. When our team faced challenging issues, she remained calm and methodical, guiding us through complex troubleshooting while ensuring knowledge transfer. Her open-door policy and willingness to share expertise helped accelerate our team's growth. She's not just a technical expert but also an inspiring leader who brings out the best in her team. Any organization would be fortunate to have her."
  },
  {
    "author": "Bráulio Alturas",
    "role": "Associate Professor",
    "company": "ISCTE - Instituto Universitário de Lisboa",
    "text": "Susana is very objective demanding tasks, very flexible and openminded"
  },
  {
    "author": "Jelle Leempoels",
    "role": "Cloud Engineer",
    "company": "Cloudar",
    "text": "I had the pleasure of working with Susana as our DevOps Team Lead. She brought a strong combination of technical expertise and human leadership to the team. Her deep knowledge of CI/CD and DevOps practices made a real impact on our workflows and productivity. She always had the team's back and created a focused, supportive environment. On top of that, she was a great person to work with  -  thoughtful, down-to-earth and human. Highly recommended."
  },
  {
    "author": "Dmitry Lavreniuk",
    "role": "Master of Business Administration | Product Manager | Product Owner",
    "company": "",
    "text": "I had the pleasure of working closely with Susana when she led the DevOps team I collaborated with. Susana stands out as a leader - she's responsible, inspiring and always communicates clearly and directly. Her approach made it easy for the team to stay aligned and focused. What really impressed me was how Susana was able to transform the operational side of the DevOps team. Thanks to her guidance, the work stream became more directed and aligned, efficiency improved and communication across the board got much smoother. She's great at motivating people and bringing out the best in those she works with. Apart from that she is a great and bright person, always a pleasure to communicate, collaborate or just hang out!"
  },
  {
    "author": "Paulo Sanches",
    "role": "Project Manager Cloud Native Architecture",
    "company": "NOSI - Núcleo Operacional da Sociedade de Informação",
    "text": "Working with Susana is a fantastic experience. she is committed to achieving the goals, has great technical skills, knows how to mobilize the team, possesses a good ability to make things happen. she is very dynamic and manages to get the team to be more productive and clear in carrying out their tasks."
  },
  {
    "author": "Benoit Thiery",
    "role": "Senior software developer and system engineer",
    "company": "",
    "text": "Susana is an exceptional DevOps professional who tackles every issue and challenge with unwavering determination until it is resolved. Her excellent communication skills enable her to gather the necessary information effectively and share her knowledge with others, while also challenging the status quo. Susana is a proactive individual who makes things happen and is a fantastic colleague to work with. I hope our paths cross again in the future and I highly recommend her for any team."
  },
  {
    "author": "Dora Carvalho",
    "role": "Técnica Superior",
    "company": "Representação Permanente de Portugal na União Europeia (REPER)",
    "text": "I had the privilege of working with Susana on several events we organized together and I can confidently say she is an outstanding professional. Methodical, focused and genuinely kind, she treats everyone with respect and always brings a positive, calm energy to the team. What truly sets Susana apart is her ability to understand the subtle nuances of what clients want  -  even when they don't articulate it clearly. She turns vision into reality with remarkable ease and dedication. Working with Susana means knowing things will run smoothly, professionally and with heart. I wholeheartedly recommend her!"
  },
  {
    "author": "Karen Avdiev",
    "role": "Lead consultant",
    "company": "",
    "text": "I had the pleasure of working alongside Susana for several years at Banque Degroof Petercam. She is a highly professional and skilled individual, that helped us on multiple projects (legacy technologies, our in-house framework, Java and Talend Studio). She consistently delivered robust production implementations and introduced testing processes for Talend projects that dramatically improved our data quality. Any team would benefit from her expertise and dedication."
  },
  {
    "author": "Sergio Soares",
    "role": "IT Director",
    "company": "Zetes Corporate",
    "text": "It is with great pleasure that I recommend Susana . She consistently demonstrates exceptional technical prowess in cloud/on prem architectures and automation, coupled with a natural ability to lead and inspire a team towards achieving critical project milestones."
  },
  {
    "author": "Philippe Detournay",
    "role": "Freelance software engineer",
    "company": "",
    "text": "I had great pleasure working with Susana. She was tasked with moving a mountain and I saw her methodically building a moutain-moving plan, building a mountain-moving team to execute this moutain-moving plan and then bring everyone along with her on this journey. I'm looking forward to opportunities to work with her again in the future."
  },
  {
    "author": "Bruno Pina",
    "role": "IT Infrastructure Engineer",
    "company": "",
    "text": "I had the opportunity to work with Susana Venda while collaborating between our departments. As a Team Leader, she stood out for her remarkable ability to foster strong, effective collaboration across teams. Her communication is always clear and constructive, creating an environment of trust and shared purpose. She consistently encouraged innovation  -  not only within her own team but also in the way our departments worked together  -  leading to more agile, forward-thinking solutions. Her contribution goes beyond her immediate responsibilities  -  she elevates the teams she works with and inspires those around her to embrace change and think creatively. I wholeheartedly recommend her for any role that values cross-functional collaboration, innovation and team leadership."
  },
  {
    "author": "Cesar Patelo",
    "role": "Analista de Sistemas de Informação",
    "company": "CGD",
    "text": "A highly skilled technology professional with a sharp analytical mind and a talent for solving complex problems efficiently. Her ability to think outside the box and adapt quickly allows her to find effective solutions and implement them with precision. Whether troubleshooting issues or developing new ideas, she consistently demonstrates quick thinking and innovation. Beyond her technical expertise, she is a supportive and approachable team player. Explains complex concepts in an understandable way, fostering collaboration and helping others grow. Her positive attitude, dedication and problem-solving mindset make her an invaluable asset to any organization."
  },
  {
    "author": "Marta Portugal",
    "role": "Senior Accounts Receivable Accountant",
    "company": "",
    "text": "Trabalhar com a Susana Venda foi um privilégio. Muito transparente e decidida, facilitou todo o processo de parceria que realizámos. Com um timing de resposta muito acima do esperado, conseguimos desenvolver toda uma campanha online de forma célere e que foi um sucesso de vendas na minha empresa."
  }
]
